using General;
using UnityEngine;

namespace Simulation {
public static class TrackNameGenerator {
	public static string getRandomName() {
		string name = generateRandomName();

		while (EditorBuildScenesHelper.isSceneWithNameExists(name))
			name = generateRandomName();

		return name;
	}

	private static string generateRandomName() {
		return "Карта - " + getRandomWord() + " " + getRandomWord();
	}

	private static string getRandomWord() {
		int randomIndex = Random.Range(0, wordList.Length);
		return wordList[randomIndex];
	}

	private static readonly string[] wordList = {
		"результат", "больше", "например", "право", "группа", "писать", "сидеть", "путь", "машина", "находиться", "увидеть", "война", "казаться", "стоять", "имя", "решить", "никогда", "стоить", "маленький", "ответ",
		"вода", "решение", "совсем", "язык", "далеко", "нужный", "давать", "ответить", "полный", "российский", "народ", "власть", "сразу", "уровень", "выйти", "ночь", "пора", "часто", "спросить", "развитие",
		"программа", "начало", "никакой", "оно", "главный", "дверь", "вместе", "момент", "закон", "число", "цель", "принять", "следующий", "написать", "отец", "правда", "нога", "старый", "помощь", "информация",
		"тысяча", "про", "подобный", "разный", "общий", "месяц", "пройти", "кроме", "минута", "мало",
		"процесс", "ситуация", "смочь", "автор", "начинать", "форма", "голос", "многий", "собственный", "мысль", "свет", "качество", "вести", "сколько", "тема", "стол", "проект", "улица", "помнить", "называть",
		"точка", "появиться", "хотеться", "нельзя", "чувство", "иногда", "слишком", "смерть", "достаточно", "лежать", "помочь", "мнение", "труд", "пять", "третий", "бывать", "заметить", "готовый", "быстро"
	};
}
}